<div class="container">
  <div class="inside">
    <section lang="he">
      <h1 class="caps">שורה חדשה</h1>
      <p class="text-ratz">
        <strong>ממשק קריאה מבוסס מעקב מבט</strong>
        אינו זמין למכשירים ניידים כרגע.
      </p>
      <p>
        <strong>נסו לצפות דרך מחשב</strong>
      </p>
    </section>

    <svg
      width="210"
      height="212"
      viewBox="0 0 210 212"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
    >
      <path
        d="M192.24 26.5H17.7598C15.2988 26.5 13.125 28.5703 13.125 31.0961V141.112C13.125 143.68 15.2578 145.709 17.7598 145.709H192.24C194.701 145.709 196.875 143.638 196.875 141.112V31.0961C196.875 28.5703 194.742 26.5 192.24 26.5ZM183.75 132.5H26.25V39.75H183.75V132.5Z"
        fill="white"
      />
      <path
        d="M124.072 185.5C135.557 185.293 141.094 183.885 135.967 180.324C130.84 176.722 124.277 173.989 124.072 171.008C123.949 169.476 123.375 152.375 123.375 152.375H86.625C86.625 152.375 86.0098 169.476 85.9277 171.008C85.7227 173.948 79.1602 176.722 74.0332 180.324C68.9062 183.927 74.4434 185.293 85.9277 185.5H124.072Z"
        fill="white"
      />
      <g clip-path="url(#clip0_422_4722)">
        <path
          d="M137.988 85.9245C137.988 85.9245 125.618 63.2891 105 63.2891C84.3822 63.2891 72.0115 85.9245 72.0115 85.9245C72.0115 85.9245 84.3822 108.56 105 108.56C125.618 108.56 137.988 85.9245 137.988 85.9245ZM76.8484 85.9245C78.8422 82.9001 81.1354 80.0833 83.6935 77.5165C89.0006 72.2115 96.258 67.4046 105 67.4046C113.742 67.4046 120.995 72.2115 126.311 77.5165C128.869 80.0833 131.162 82.9001 133.156 85.9245C132.917 86.2825 132.653 86.6776 132.352 87.1098C130.97 89.0852 128.929 91.7191 126.311 94.3325C120.995 99.6374 113.738 104.444 105 104.444C96.258 104.444 89.0047 99.6374 83.6894 94.3325C81.1313 91.7657 78.8381 88.9489 76.8443 85.9245H76.8484Z"
          fill="white"
        />
        <path
          d="M105 75.636C102.266 75.636 99.6438 76.72 97.7105 78.6496C95.7772 80.5791 94.6911 83.1961 94.6911 85.9249C94.6911 88.6536 95.7772 91.2706 97.7105 93.2002C99.6438 95.1297 102.266 96.2137 105 96.2137C107.734 96.2137 110.356 95.1297 112.289 93.2002C114.223 91.2706 115.309 88.6536 115.309 85.9249C115.309 83.1961 114.223 80.5791 112.289 78.6496C110.356 76.72 107.734 75.636 105 75.636ZM90.5675 85.9249C90.5675 82.1046 92.0881 78.4408 94.7947 75.7394C97.5013 73.0381 101.172 71.5205 105 71.5205C108.828 71.5205 112.499 73.0381 115.205 75.7394C117.912 78.4408 119.432 82.1046 119.432 85.9249C119.432 89.7451 117.912 93.4089 115.205 96.1103C112.499 98.8116 108.828 100.329 105 100.329C101.172 100.329 97.5013 98.8116 94.7947 96.1103C92.0881 93.4089 90.5675 89.7451 90.5675 85.9249Z"
          fill="white"
        />
      </g>
      <defs>
        <clipPath id="clip0_422_4722">
          <rect
            width="65.977"
            height="65.8485"
            fill="white"
            transform="translate(72.0115 53)"
          />
        </clipPath>
      </defs>
    </svg>

    <section lang="en">
      <h1>new line</h1>
      <p class="text-ratz ltr">
        <strong>a gaze based reading platform</strong>
        is not yet available for mobile.
      </p>
      <p>
        <strong>Try viewing via desktop</strong>
      </p>
    </section>
  </div>
</div>

<style lang="scss">
  .container {
    min-height: 100vh;
    text-align: center;
    background: var(--blue);
    color: var(--white);
    // display: flex;
    padding-top: 6vh;
    // align-items: center;
    // justify-content: center;
    .inside {
      padding: 2em;
    }
    svg {
        max-height: 23vh;
        margin-bottom: -0.1em;
    }

    h1 {
      color: inherit;
      margin: 0;
    }
    p {
      margin: 0.6em 0;
      font-size: 1.25em;
    }

    section[lang="he"] {
      direction: rtl;
    }

    margin: 0;

    font-variation-settings: "wght" 700, "wdth" 100;

    font-family: var(--narkiss-block);
    font-style: normal;
    // font-size: 2em;
    text-align: center;
    margin: 0 auto;
    text-transform: lowercase;
    font-feature-settings: "smcp";
    line-height: 1.5;
  }
</style>
